{
  "backend/main.mo": "Motoko actor storing installCount with query getter and shared increment method.",
  "feature_evidence.json": "Feature evidence report listing hero rendering bugs, fallback requirements, and affected files/components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose of each frontend landing-page file.",
  "frontend/docs/landing-customization.md": "Guide explaining how to customize APK link, install counter, landing structure, copy, and visual effects.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH variables, dark mode tokens, and base layout.",
  "frontend/index.html": "Root HTML file mounting React app and loading main.tsx.",
  "frontend/src/App.tsx": "App entry wrapping LandingPage with React Query and dark-only ThemeProvider.",
  "frontend/src/components/admin/AdminPanel.tsx": "Empty placeholder component.",
  "frontend/src/components/landing/download.ts": "Centralized APK download link and handler opening Expo artifact in new tab.",
  "frontend/src/components/landing/effects/CursorGlow.tsx": "Mouse‑tracking glow effect that disables on touch devices.",
  "frontend/src/components/landing/GlassPanel.tsx": "Reusable glassmorphism wrapper component with optional strong variant.",
  "frontend/src/components/landing/hero/FaultyTerminal.css": "Styles for hero WebGL background with fallback gradient when WebGL fails.",
  "frontend/src/components/landing/hero/FaultyTerminal.tsx": "WebGL shader-based terminal effect component with mouse/reactive and glitch parameters.",
  "frontend/src/components/landing/hero/FloatingMockups.tsx": "Empty or truncated file; content not provided.",
  "frontend/src/components/landing/hero/HeroBackground.tsx": "Canvas-based animated particle background with resize handling and subtle gradient overlay.",
  "frontend/src/components/landing/InstallsCounterBar.tsx": "Displays install count from backend via useInstallCount at top of page.",
  "frontend/src/components/landing/landingConfig.ts": "Central config for landing page CTAs and APK download URL pulled from download module.",
  "frontend/src/components/landing/landingCopy.ts": "Static text content and section IDs for all landing page sections.",
  "frontend/src/components/landing/LandingPage.tsx": "Main landing layout composing all sections plus cursor glow and install bar.",
  "frontend/src/components/landing/ResponsiveContainer.tsx": "Utility container providing consistent responsive padding and width.",
  "frontend/src/components/landing/Section.tsx": "Generic section wrapper adding scroll reveal animations via useScrollReveal.",
  "frontend/src/components/landing/sections/AsciiKarmSection.tsx": "Section rendering large ASCII-styled 'KARM' text using the AsciiText component.",
  "frontend/src/components/landing/sections/CultLineSection.tsx": "Centered section displaying the cult-line headline and subtext from landing copy.",
  "frontend/src/components/landing/sections/FinalCTASection.tsx": "Final CTA section with download button triggering APK download and install count increment, plus footer.",
  "frontend/src/components/landing/sections/ForWhoSection.tsx": "Empty placeholder section file.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Hero section with animated terminal background, wordmark, tagline, and download/scroll CTAs.",
  "frontend/src/components/landing/sections/ProblemSection.tsx": "Empty placeholder section file.",
  "frontend/src/components/landing/sections/ProductShowcaseSection.tsx": "Empty placeholder section file.",
  "frontend/src/components/landing/sections/PsychologicalHitSection.tsx": "Scroll-triggered sequential text reveal section using IntersectionObserver.",
  "frontend/src/components/landing/sections/SocialProofSection.tsx": "Simple social proof text section populated from landing copy.",
  "frontend/src/components/landing/sections/TransformationSection.tsx": "Empty placeholder section file.",
  "frontend/src/components/landing/sections/WhatItDoesSection.tsx": "Three-column feature description section sourced from landing copy.",
  "frontend/src/components/landing/three/AsciiText.tsx": "Three.js-based ASCII rendering system with custom shaders and mouse-reactive ASCII filter.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching backend actor instances tied to identity changes with query invalidation.",
  "frontend/src/hooks/useInstallCount.ts": "Hook managing install count fetch and optimistic increment via actor methods and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identities, and AuthClient initialization.",
  "frontend/src/hooks/useParallax.ts": "Implements a scroll-based parallax effect hook that returns a vertical offset based on element position.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file; all landing page data is static elsewhere.",
  "frontend/src/hooks/useScrollReveal.ts": "Implements an IntersectionObserver-based hook that marks an element visible once it enters the viewport.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom CSS variables, dark mode tokens, utility classes, and animations.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, plugins, and container settings.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to fixing a white screen in the hero section."
}