{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of various frontend components and configuration files.",
  "frontend/docs/landing-customization.md": "Documentation explaining how to customize the landing page and update the fixed APK link.",
  "frontend/index.css": "Tailwind base and theme variable definitions with dark-mode color tokens and global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Wraps the LandingPage with theme and React Query providers using a forced dark theme.",
  "frontend/src/components/admin/AdminPanel.tsx": "Empty placeholder file for an admin panel component.",
  "frontend/src/components/landing/download.ts": "Provides the fixed Google Drive APK download URL and a handler that opens it in a new tab.",
  "frontend/src/components/landing/effects/CursorGlow.tsx": "Mouse‑tracking glow effect that appears only on hover-capable devices.",
  "frontend/src/components/landing/GlassPanel.tsx": "Reusable glass panel component with optional strong variant.",
  "frontend/src/components/landing/hero/FloatingMockups.tsx": "Empty placeholder file for floating mockup visuals.",
  "frontend/src/components/landing/hero/HeroBackground.tsx": "Canvas-based animated particle background with reduced particles and subtle aura.",
  "frontend/src/components/landing/landingConfig.ts": "Centralized configuration for landing page CTAs using the fixed APK URL.",
  "frontend/src/components/landing/landingCopy.ts": "Centralized text copy for all landing sections with no image references.",
  "frontend/src/components/landing/LandingPage.tsx": "Assembles all landing sections into a single scrollable page with a cursor glow effect.",
  "frontend/src/components/landing/ResponsiveContainer.tsx": "Responsive layout wrapper providing standardized max-width and padding.",
  "frontend/src/components/landing/Section.tsx": "Section wrapper with scroll‑reveal animation triggered via IntersectionObserver.",
  "frontend/src/components/landing/sections/CultLineSection.tsx": "Minimal text-centered section rendering the main and sub cult lines.",
  "frontend/src/components/landing/sections/FinalCTASection.tsx": "Final CTA section with a download button wired to the fixed APK link and a footer.",
  "frontend/src/components/landing/sections/ForWhoSection.tsx": "Empty placeholder for the “For Who” section.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Renders the hero section with background, tagline, and primary/secondary CTAs including APK download and smooth scroll.",
  "frontend/src/components/landing/sections/ProblemSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/landing/sections/ProductShowcaseSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/landing/sections/PsychologicalHitSection.tsx": "Displays animated psychological lines triggered by intersection observer as the user scrolls.",
  "frontend/src/components/landing/sections/SocialProofSection.tsx": "Shows social proof text lines pulled from landing copy inside a centered section.",
  "frontend/src/components/landing/sections/TransformationSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/landing/sections/WhatItDoesSection.tsx": "Renders a three-column grid describing what the product does using static landing copy blocks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout flows.",
  "frontend/src/hooks/useParallax.ts": "Computes a parallax offset based on scroll position using throttled scroll events.",
  "frontend/src/hooks/useQueries.ts": "Empty file noting no backend queries exist.",
  "frontend/src/hooks/useScrollReveal.ts": "Uses intersection observer to reveal elements once they enter view.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, utility classes, animations, and glass/CTA styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, spacing, animations, and enabling plugins.",
  "project_state.json": "Defines the current project state and design requirements for a premium black minimalist KARM landing page using a fixed APK link and no images/mockups. Includes aesthetic rules, motion guidelines, known issues, and a list of existing features and requirements."
}