{
  "backend/main.mo": "Empty Motoko actor definition.",
  "feature_evidence.json": "Feature evidence report detailing implemented landing page features and associated files.",
  "frontend-file-summaries.txt": "Text file containing auto-generated summaries for many frontend components and hooks.",
  "frontend/docs/landing-customization.md": "Guide explaining landing page structure and how to change the APK download link.",
  "frontend/index.css": "Tailwind base styles and theme variables defining OKLCH color tokens and dark/light modes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app wrapper with dark theme enforcement and React Query provider.",
  "frontend/src/components/admin/AdminPanel.tsx": "Empty admin panel file.",
  "frontend/src/components/landing/download.ts": "Hardcoded APK download URL and shared download handler.",
  "frontend/src/components/landing/effects/CursorGlow.tsx": "Mouse‑tracking glow effect hidden on touch devices.",
  "frontend/src/components/landing/GlassPanel.tsx": "Reusable glass panel wrapper component with optional strong variant.",
  "frontend/src/components/landing/hero/FaultyTerminal.css": "CSS for FaultyTerminal WebGL effect container and canvas sizing.",
  "frontend/src/components/landing/hero/FaultyTerminal.tsx": "WebGL shader‑based animated terminal effect with noise, glitch, and scanline uniforms.",
  "frontend/src/components/landing/hero/FloatingMockups.tsx": "Empty component file.",
  "frontend/src/components/landing/hero/HeroBackground.tsx": "Canvas‑based particle and subtle aura background for the hero section.",
  "frontend/src/components/landing/landingConfig.ts": "Centralized landing config wiring CTA behaviors and download URL reference.",
  "frontend/src/components/landing/landingCopy.ts": "Defines all static landing page copy and section IDs used across components.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes all landing sections and cursor glow into the main scroll flow.",
  "frontend/src/components/landing/ResponsiveContainer.tsx": "Responsive layout container applying consistent padding and max-width.",
  "frontend/src/components/landing/Section.tsx": "Generic section wrapper with scroll-reveal fade/translate animation.",
  "frontend/src/components/landing/sections/AsciiKarmSection.tsx": "Renders a full-width section displaying the animated ASCII 'KARM' text.",
  "frontend/src/components/landing/sections/CultLineSection.tsx": "Shows an image and the cult-line text from landing copy within a centered section.",
  "frontend/src/components/landing/sections/FinalCTASection.tsx": "Displays the final call‑to‑action with a download button and footer credit.",
  "frontend/src/components/landing/sections/ForWhoSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Implements the hero section with animated background, wordmark, tagline, and primary/secondary CTAs.",
  "frontend/src/components/landing/sections/ProblemSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/landing/sections/ProductShowcaseSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/landing/sections/PsychologicalHitSection.tsx": "Animates psychological‑hit lines as they appear using an IntersectionObserver.",
  "frontend/src/components/landing/sections/SocialProofSection.tsx": "Renders short social‑proof lines from landing copy in a centered section.",
  "frontend/src/components/landing/sections/TransformationSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/landing/sections/WhatItDoesSection.tsx": "Renders three feature blocks describing what the product does using landing copy.",
  "frontend/src/components/landing/three/AsciiText.tsx": "Implements a Three.js ASCII rendering system with custom shaders and a filter class.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for initializing, logging in, and managing Internet Identity state.",
  "frontend/src/hooks/useParallax.ts": "Calculates parallax offset based on scroll progress for a referenced element.",
  "frontend/src/hooks/useQueries.ts": "Empty file noting that the backend exposes no query methods.",
  "frontend/src/hooks/useScrollReveal.ts": "Exposes a hook that marks elements visible once they enter view using IntersectionObserver.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, dark mode variables, and custom utility classes including glass effects, animations, and CTA styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors tied to CSS variables, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes current project requirements and planned features, mainly adding ASCII Three.js hero text, inserting an image, and adjusting landing page text."
}