{
  "kind": "build_request",
  "title": "Remove CultLineSection image from landing page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the image from the landing page CultLineSection so that the section only shows the heading and subtext (no screenshot/card image rendered).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove that image for real"
        ]
      },
      "acceptanceCriteria": [
        "CultLineSection no longer renders an <img> element or any visual image placeholder above the cult line heading.",
        "The CultLineSection layout remains centered and visually balanced after the image removal (no unintended extra vertical whitespace from the removed image wrapper).",
        "No other landing sections (Hero, PsychologicalHit, WhatItDoes, AsciiKarm, SocialProof, FinalCTA) change behavior or content."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the unused static asset reference to \"/assets/generated/karm-whatsapp-card.dim_736x1472.jpg\" from the codebase, and delete the file from the frontend public assets if it is no longer used anywhere in the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove that image for real"
        ]
      },
      "acceptanceCriteria": [
        "The string path \"/assets/generated/karm-whatsapp-card.dim_736x1472.jpg\" is no longer referenced in frontend source code.",
        "If the file is not referenced anywhere else, it is removed from the repository under frontend/public/assets/generated/ (or the appropriate public assets folder).",
        "The app builds successfully with no missing-asset console errors in the browser."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any other paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not change landing page copy text.",
    "Do not add new images or replacement graphics.",
    "Do not change backend behavior or add backend features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}