{
  "kind": "build_request",
  "title": "Fix white/blank screen in hero section around KARM + FaultyTerminal background",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the white/blank screen appearing in the main hero section where the \"KARM\" wordmark is displayed over the FaultyTerminal background, so the hero consistently renders with a dark background and the intended terminal effect across supported browsers/devices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "bro why there is white screen at main section where karm is written with faulty terminal"
        ]
      },
      "acceptanceCriteria": [
        "On page load, the hero section does not show a solid white block/flash in the area behind/around the \"KARM\" wordmark.",
        "The FaultyTerminal background renders correctly (animated terminal effect) on browsers/devices with WebGL support.",
        "No new console errors are emitted during normal hero rendering (excluding existing unrelated warnings)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a graceful fallback for the FaultyTerminal component when WebGL context creation, shader compilation, or program linking fails, ensuring the hero section still displays a dark, visually coherent background instead of a white/blank screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "white screen at main section where karm is written with faulty terminal"
        ]
      },
      "acceptanceCriteria": [
        "If WebGL is unavailable or shader/program setup fails, the hero section shows a non-white fallback background (e.g., solid black or subtle dark gradient) and the rest of the hero content remains readable.",
        "The FaultyTerminal component cleans up event listeners/animation frames without throwing errors when unmounted, regardless of whether it initialized WebGL successfully."
      ]
    }
  ],
  "constraints": [
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead).",
    "Keep all changes within the existing React + TypeScript + Tailwind setup; no new backend services or external dependencies that violate platform constraints."
  ],
  "nonGoals": [
    "No changes to backend install counter logic or persistence.",
    "No redesign of landing page content/sections beyond what is needed to eliminate the white/blank screen and provide a fallback for the FaultyTerminal effect."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}