{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Landing page blended analytics-style stats block above ASCII KARM section",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new landing-page analytics-style UI block that matches the site’s monochrome glass styling and resembles the provided AnalyticsScreen layout.",
      "acceptanceCriteria": [
        "On the landing page, a new stats/mock analytics block appears directly before the ASCII KARM renderer (i.e., above it in the scroll order).",
        "The new block uses the site’s existing monochrome/glass styling (e.g., `.glass-panel` / `.glass-panel-strong`) and does not look like an unstyled embed.",
        "No React Native / Expo-specific imports exist in the web code; the UI is recreated using React + Tailwind components.",
        "The ASCII KARM renderer still renders and behaves as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/sections/AnalyticsMockSection.tsx",
          "operation": "create",
          "description": "Add a new landing section implementing an analytics-style block (header + central deck/cards feel) using existing site primitives (use `Section` for consistent spacing/reveal, `ResponsiveContainer` for layout, and `GlassPanel` with `.glass-panel` / `.glass-panel-strong` to match the monochrome glass aesthetic)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add any minimal, reusable utility classes needed to help the new analytics block blend with the existing monochrome/glass style (e.g., subtle borders, glows, or card separators) without changing the look/behavior of existing sections."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show hard-coded fake stats in the analytics block with exact values and computed Karm.",
      "acceptanceCriteria": [
        "The analytics block shows Level: 23.",
        "The analytics block shows Karm equal to 82800 (computed from 23*3600).",
        "The analytics block shows Habits: 4.",
        "The analytics block shows Challenges: 24.",
        "All labels and visible text are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/sections/AnalyticsMockSection.tsx",
          "operation": "modify",
          "description": "Render the fake stats in the analytics UI: Level = 23, Karm displayed as the computed number from 23*3600 (82800), Habits = 4, Challenges = 24; ensure all labels are English and values are hard-coded (no backend calls)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Blend the new analytics block’s background/atmosphere using existing site patterns and ensure reduced-motion compliance.",
      "acceptanceCriteria": [
        "If an animated background effect is used in the analytics block, it disables or becomes static when the user prefers reduced motion.",
        "The analytics block content remains readable with sufficient contrast against the background."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/sections/AnalyticsMockSection.tsx",
          "operation": "modify",
          "description": "Add an atmospheric background treatment behind the analytics block that matches the site (e.g., reuse `SnowDotsBackground` subtly behind content with appropriate opacity and layering, plus any non-animated gradient/vignette overlays) while keeping text/card contrast high."
        },
        {
          "path": "frontend/src/components/landing/hero/SnowDotsBackground.tsx",
          "operation": "modify",
          "description": "Refine reduced-motion behavior so the snow dots effect becomes static (or otherwise non-animated) when `prefers-reduced-motion: reduce` is enabled, maintaining the existing hero usage while ensuring accessibility expectations for the new analytics block."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Insert the analytics block into the landing page immediately above the existing ASCII KARM section without reordering other sections.",
      "acceptanceCriteria": [
        "LandingPage order results in the analytics block appearing immediately before the ASCII KARM section.",
        "No other landing sections are removed or reordered besides inserting this new block in the correct position."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/LandingPage.tsx",
          "operation": "modify",
          "description": "Wire `AnalyticsMockSection` into the landing composition by importing and rendering it immediately before `AsciiKarmSection`, leaving all other sections intact and in the same order."
        }
      ]
    }
  ]
}