{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize FaultyTerminal hero rendering and add WebGL-failure fallback",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Eliminate the white/blank flash/block in the hero where the KARM wordmark overlays the FaultyTerminal background, ensuring consistent dark rendering and no new console errors during normal operation.",
      "acceptanceCriteria": [
        "On page load, the hero section does not show a solid white block/flash in the area behind/around the \"KARM\" wordmark.",
        "The FaultyTerminal background renders correctly (animated terminal effect) on browsers/devices with WebGL support.",
        "No new console errors are emitted during normal hero rendering (excluding existing unrelated warnings)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/hero/FaultyTerminal.tsx",
          "operation": "modify",
          "description": "Harden WebGL initialization to prevent transient white/transparent canvas states: prefer an opaque WebGL context (avoid alpha transparency where possible), ensure the canvas is painted dark immediately on init (and not left uninitialized), and gate logging so normal successful initialization does not emit new console errors."
        },
        {
          "path": "frontend/src/components/landing/hero/FaultyTerminal.css",
          "operation": "modify",
          "description": "Ensure the FaultyTerminal container and canvas have a consistent dark background (e.g., black) to prevent white showing through during first paint, resize, or brief initialization delays."
        },
        {
          "path": "frontend/src/components/landing/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Add an explicit dark background layer for the hero section behind the FaultyTerminal mount area so the hero remains dark even before the WebGL canvas draws its first frame, without changing overall content/CTA layout."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a graceful non-white fallback when FaultyTerminal cannot initialize WebGL or compile/link shaders, and ensure cleanup is safe regardless of init success.",
      "acceptanceCriteria": [
        "If WebGL is unavailable or shader/program setup fails, the hero section shows a non-white fallback background (e.g., solid black or subtle dark gradient) and the rest of the hero content remains readable.",
        "The FaultyTerminal component cleans up event listeners/animation frames without throwing errors when unmounted, regardless of whether it initialized WebGL successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/hero/FaultyTerminal.tsx",
          "operation": "modify",
          "description": "Implement an internal fallback mode when WebGL context creation or shader/program setup fails: render a dark fallback background instead of a blank/white area, avoid throwing, and ensure unmount cleanup is robust even when initialization exits early (cancel RAF safely, disconnect observers, and only delete WebGL resources if they were created)."
        },
        {
          "path": "frontend/src/components/landing/hero/FaultyTerminal.css",
          "operation": "modify",
          "description": "Add styling for the fallback state (dark solid/gradient background) that matches the hero aesthetic and guarantees readability of overlaid hero text."
        }
      ]
    }
  ]
}