{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove CultLineSection image and unused landing asset",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the CultLineSection screenshot/card image so only heading and subtext render, keeping the section centered and balanced.",
      "acceptanceCriteria": [
        "CultLineSection no longer renders an <img> element or any visual image placeholder above the cult line heading.",
        "The CultLineSection layout remains centered and visually balanced after the image removal (no unintended extra vertical whitespace from the removed image wrapper).",
        "No other landing sections (Hero, PsychologicalHit, WhatItDoes, AsciiKarm, SocialProof, FinalCTA) change behavior or content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/sections/CultLineSection.tsx",
          "operation": "modify",
          "description": "Remove the image wrapper and <img> element from CultLineSection; adjust the surrounding spacing classes so the section remains visually balanced with only the heading and subtext."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the unused generated WhatsApp card asset reference from the codebase and delete the asset file if it is no longer used.",
      "acceptanceCriteria": [
        "The string path \"/assets/generated/karm-whatsapp-card.dim_736x1472.jpg\" is no longer referenced in frontend source code.",
        "If the file is not referenced anywhere else, it is removed from the repository under frontend/public/assets/generated/ (or the appropriate public assets folder).",
        "The app builds successfully with no missing-asset console errors in the browser."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/sections/CultLineSection.tsx",
          "operation": "modify",
          "description": "Ensure the hardcoded asset string \"/assets/generated/karm-whatsapp-card.dim_736x1472.jpg\" is fully removed from this component (and no longer referenced after the image removal)."
        },
        {
          "path": "frontend/public/assets/generated/karm-whatsapp-card.dim_736x1472.jpg",
          "operation": "delete",
          "description": "Delete the unused static asset file frontend/public/assets/generated/karm-whatsapp-card.dim_736x1472.jpg if it is not referenced anywhere else in the app."
        }
      ]
    }
  ]
}